##################
#### PREAMBLE ####
##################

tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/bundle'

tap 'brettferdosi/tap'

# mac app store CLI needed later
brew 'mas'

##################
#### FORMULAE ####
##################

brew 'git'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'gnupg'
brew 'ffmpeg'
brew 'imagemagick'
brew 'lynx'
brew 'python'

cask 'google-drive-file-stream'
cask 'mactex'
cask 'clion'
cask 'pycharm'
cask 'appcleaner'
cask 'gimp'
cask 'firefox'
cask 'spotify'

cask 'brettferdosi/tap/grayscale'

mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
mas 'Xcode', id: 497799835
mas 'Vectornator: Design Software', id: 1219074514
mas 'Amphetamine', id: 937984704
# mas 'Pages', id: 409201541
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
